ReFlo/micropython/ports/tm4c123/mods/timer.c
/*******************************************************************************
 *
 Create Timer (from cc3200)
 *****************************************************************************/
STATIC const mp_irq_methods_t machine_timer_channel_irq_methods;
STATIC machine_timer_obj_t machine_timer_obj[MICROPY_HW_MAX_TIMER] = {{.timer = TIMER0_BASE, .peripheral = SYSCTL_PERIPH_TIMER0},
                                                             {.timer = TIMER1_BASE, .peripheral = SYSCTL_PERIPH_TIMER1},
                                                             {.timer = TIMER2_BASE, .peripheral = SYSCTL_PERIPH_TIMER2},
                                                             {.timer = TIMER3_BASE, .peripheral = SYSCTL_PERIPH_TIMER3},
                                                             {.timer = TIMER4_BASE, .peripheral = SYSCTL_PERIPH_TIMER4},
                                                             {.timer = TIMER5_BASE, .peripheral = SYSCTL_PERIPH_TIMER5}};
STATIC const mp_obj_type_t machine_timer_channel_type;
// !!!!!!!!!!!!!!!Real Pins needed to be added!!!!!!!!!!!!!!!!
// STATIC const mp_obj_t machine_timer_pwm_pin[8] = {pin_PA4, MP_OBJ_NULL, pin_PA5, MP_OBJ_NULL, MP_OBJ_NULL, pin_PA0, pin_PC1};

void timer_init0 (void) {
    mp_obj_list_init(&MP_STATE_PORT(mp_timer_channel_obj_list), 0);
}

STATIC void timer_init (machine_timer_obj_t *tim) {

    SysCtlPeripheralEnable(tim->peripheral);
    SysCtlPeripheralReset(tim->peripheral);
    while(!SysCtlPeripheralReady(tim->peripheral));
    TimerDisable(tim->timer,TIMER_BOTH);
    TimerConfigure(tim->timer,tim->config);
}


STATIC mp_obj_t machine_timer_init_helper(machine_timer_obj_t *tim, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,         MP_ARG_REQUIRED | MP_ARG_INT, },
        { MP_QSTR_width,        MP_ARG_KW_ONLY  | MP_ARG_INT, {.u_int = 16} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // check the mode
    uint32_t _mode = args[0].u_int;
    if (_mode != TIMER_CFG_A_ONE_SHOT_UP && _mode != TIMER_CFG_A_PERIODIC_UP && _mode != TIMER_CFG_A_PWM) {
        goto error;
    }

    // check the width
    if (args[1].u_int != 16 && args[1].u_int != 32) {
        goto error;
    }
    bool is16bit = (args[1].u_int == 16);

    if (!is16bit && _mode == TIMER_CFG_A_PWM) {
        // 32-bit mode is only available when in free running modes
        goto error;
    }
    if(is16bit){
        tim->config = _mode;
    }
    // tim->config = is16bit ? ((_mode | (_mode << 8)) | TIMER_CFG_SPLIT_PAIR) : _mode;

    // register it with the sleep module
    // pyb_sleep_add ((const mp_obj_t)tim, (WakeUpCB_t)timer_init);
    timer_init(tim);

    return mp_const_none;

error:
    mp_raise_ValueError(MP_ERROR_TEXT("invalid argument(s) value"));
}

STATIC mp_obj_t machine_timer_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // create a new Timer object
    int32_t timer_idx = mp_obj_get_int(args[0]);
    if (timer_idx < 0 || timer_idx > (MICROPY_HW_MAX_TIMER - 1)) {
        mp_raise_OSError(MP_ENODEV);
    }

    machine_timer_obj_t *tim = &machine_timer_obj[timer_idx];
    tim->base.type = &machine_timer_type;
    tim->id = timer_idx;

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        machine_timer_init_helper(tim, n_args - 1, args + 1, &kw_args);
    }
    return (mp_obj_t)tim;
}

STATIC mp_obj_t machine_timer_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return machine_timer_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_timer_init_obj, 1, machine_timer_init);

/******************************************************************************
 DEFINE PRIVATE DATA
 ******************************************************************************/

/******************************************************************************/

/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/

STATIC void machine_timer_channel_irq_enable (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    MAP_TimerIntClear(self->timer->timer, self->timer->irq_trigger & self->channel);
    MAP_TimerIntEnable(self->timer->timer, self->timer->irq_trigger & self->channel);
}

STATIC void machine_timer_channel_irq_disable (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    MAP_TimerIntDisable(self->timer->timer, self->timer->irq_trigger & self->channel);
}

STATIC int machine_timer_channel_irq_flags (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    return self->timer->irq_flags;
}

STATIC machine_timer_channel_obj_t *machine_timer_channel_find (uint32_t timer, uint16_t channel_n) {
    for (mp_uint_t i = 0; i < MP_STATE_PORT(mp_timer_channel_obj_list).len; i++) {
        machine_timer_channel_obj_t *ch = ((machine_timer_channel_obj_t *)(MP_STATE_PORT(mp_timer_channel_obj_list).items[i]));
        // any 32-bit timer must be matched by any of its 16-bit versions
        if (ch->timer->timer == timer && ((ch->channel & TIMER_A) == channel_n || (ch->channel & TIMER_B) == channel_n)) {
            return ch;
        }
    }
    return MP_OBJ_NULL;
}

STATIC mp_obj_t machine_timer_channel_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[mp_irq_INIT_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, mp_irq_INIT_NUM_ARGS, mp_irq_init_args, args);
    machine_timer_channel_obj_t *ch = pos_args[0];

    // convert the priority to the correct value
    uint priority = args[1].u_int;

    // // validate the power mode
    // int pwrmode = (args[3].u_obj == mp_const_none) ? PYB_PWR_MODE_ACTIVE : mp_obj_get_int(args[3].u_obj);
    // if (pwrmode != PYB_PWR_MODE_ACTIVE) {
    //     goto invalid_args;
    // }

    // get the trigger
    uint trigger = mp_obj_get_int(args[0].u_obj);

